print(2 + 5)            # сложение
print(4 - 1)            # вычитание
print(9 * 2)            # умножение
print(10 / 10)          # Деление
print(12 // 10)         # Получение целой части от деления
print(12 % 10)          # Получение остатка от деления
print(abs(-10))         # Модуль числа  # Отбрасывает Минус
print(2 ** 10)          # Возведение в степень
print(0.3 + 0.3 + 0.3)  # Вещественные числа
print(type(1))          # Определяем тип обычного числа
print(type(0.1))        # Определяем тип числа с плавающей запятой
print(round(0.4))       # Округление числа # От нуля до пяти Включительно округляются в меньшую сторону
print(round(1.5))       # Округление до ближайшего Чётного числа
print(2 + 3 * 5 ** 2)   # Сложное выражение, операции идут по математическим правилам
print((2 + 3) * 5 ** 2)  # Приоритет операций можно менять с помощью скобок
print(2 + 0.1)          # Можно взаимодействовать между типами int И float
print(555e-2)           # Запись float Числа в экспоненциальном формате
print(555 * 10 ** -2)   # Выражение выше
